In [30]:
import pandas as pd
import numpy as np
from sklearn import linear_model
from sklearn import model_selection
from sklearn.metrics import classification_report
from sklearn.metrics import confusion_matrix
from sklearn.metrics import accuracy_score
import matplotlib.pyplot as plt
import seaborn as sb
from sklearn.preprocessing import LabelEncoder
from sklearn.linear_model import LogisticRegression
from sklearn import metrics
%matplotlib inline

In [37]:
full_data = pd.read_csv('../data/final_data/full_data_postulaciones.csv')

In [38]:
full_data.head()

,idpostulante,valor_educacion,sexo,edad,idaviso,fechapostulacion,tipo_de_trabajo,nivel_laboral,denominacion_empresa
0,NdJl,15,1,51.0,1112260409,2018-01-24 05:17:29,1,4,NEW TALENT
1,66XQMv,15,1,38.0,1112260409,2018-01-18 14:34:47,1,4,NEW TALENT
2,ZlXp1Y,15,1,39.0,1112260409,2018-01-17 08:02:27,1,4,NEW TALENT
3,6oYpOv,15,0,48.0,1112260409,2018-01-16 15:22:42,1,4,NEW TALENT
4,ewQq5r,15,0,48.0,1112260409,2018-01-22 02:34:02,1,4,NEW TALENT

In [39]:
full_data.drop('denominacion_empresa', axis=1, inplace=True)

In [40]:
full_data.head()

,idpostulante,valor_educacion,sexo,edad,idaviso,fechapostulacion,tipo_de_trabajo,nivel_laboral
0,NdJl,15,1,51.0,1112260409,2018-01-24 05:17:29,1,4
1,66XQMv,15,1,38.0,1112260409,2018-01-18 14:34:47,1,4
2,ZlXp1Y,15,1,39.0,1112260409,2018-01-17 08:02:27,1,4
3,6oYpOv,15,0,48.0,1112260409,2018-01-16 15:22:42,1,4
4,ewQq5r,15,0,48.0,1112260409,2018-01-22 02:34:02,1,4

In [41]:
full_data['se_postulo'] = 1
full_data.head()

,idpostulante,valor_educacion,sexo,edad,idaviso,fechapostulacion,tipo_de_trabajo,nivel_laboral,se_postulo
0,NdJl,15,1,51.0,1112260409,2018-01-24 05:17:29,1,4,1
1,66XQMv,15,1,38.0,1112260409,2018-01-18 14:34:47,1,4,1
2,ZlXp1Y,15,1,39.0,1112260409,2018-01-17 08:02:27,1,4,1
3,6oYpOv,15,0,48.0,1112260409,2018-01-16 15:22:42,1,4,1
4,ewQq5r,15,0,48.0,1112260409,2018-01-22 02:34:02,1,4,1

In [43]:
full_data.drop(['fechapostulacion', 'idaviso'],axis=1,inplace=True)

In [44]:
y = np.array(full_data['se_postulo'])

In [45]:
#cat_columns = full_data.select_dtypes(['idpostulante']).columns
#full_data[cat_columns] = full_data[cat_columns].apply(lambda x: x.cat.codes)
# Convierto el nombre del area a category.
full_data['idpostulante'] = full_data['idpostulante'].astype('category')

In [46]:
#cat_columns = full_data.select_dtypes(['idpostulante']).columns
lb_make = LabelEncoder()
full_data["idpostulante2"] = lb_make.fit_transform(full_data["idpostulante"])
full_data[["idpostulante", "idpostulante2"]].head()
#full_data[cat_columns] = full_data[cat_columns].apply(lambda x: x.cat.codes)

  idpostulante  idpostulante2
0         NdJl         116209
1       66XQMv          38071
2       ZlXp1Y         166635
3       6oYpOv          41817
4       ewQq5r         198682

In [28]:
X = np.array(full_data.drop(['fechapostulacion','idaviso','idpostulante'],1))
X.shape

(4855432, 7)

In [51]:
full_data.drop('idpostulante', axis=1, inplace=True)

In [52]:
full_data_m = full_data.as_matrix()
full_data_m = np.matrix(full_data_m)

In [53]:
# CREA dataset TRAIN y TEST
#---------------------------------------------------------------------------------------------
np.random.seed(123)
m_train    = np.random.rand(len(full_data_m)) < 0.5
data_train = full_data_m[m_train,]
data_test  = full_data_m[~m_train,]

In [54]:
# CLASE
#---------------------------------------------------------------------------------------------
clase_train = data_train[:,-1]
clase_train = clase_train.A1 #convierte de matriz a vector 
clase_test  = data_test[:,-1]
clase_test  = clase_test.A1 #convierte de matriz a vector

In [ ]:
# MODELO
#---------------------------------------------------------------------------------------------
modelo_lr = LogisticRegression()
modelo_lr.fit(X=data_train[:,:-1],y=clase_train)

In [ ]:

# PREDICCION
#---------------------------------------------------------------------------------------------
predicion = modelo_lr.predict(data_test[:,:-1])


# METRICAS
#---------------------------------------------------------------------------------------------
print(metrics.classification_report(y_true=clase_test, y_pred=predicion))
print(pd.crosstab(data_test[:,-1].A1, predicion, rownames=['REAL'], colnames=['PREDICCION']))